Revit 2027 API
IFCFile.Read(IFCFileReadOptions) Method
 Reads content from a file of IFC format.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Read(
	IFCFileReadOptions readOptions
)
Public Sub Read (
	readOptions As IFCFileReadOptions
)
public:
void Read(
	IFCFileReadOptions^ readOptions
)
member Read :
        readOptions : IFCFileReadOptions -> unit
Parameters
readOptions IFCFileReadOptions
 The IFC file read options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Error reading opening model for unzipping. Error reading IFC file.
See Also
Reference
IFCFile Class
Read Overload
Autodesk.Revit.DB.IFC Namespace